app/controllers/albums_controller.rb

    def set_album
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]