app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.album_id = params[:album_id]


    if @review.save
---
INSERT INTO "reviews" ("title", "content", "author", "created_at", "updated_at", "album_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "akjfd"], ["content", "afdfadsf"], ["author", "dgakjdf"], ["created_at", "2018-01-17 03:13:09.009358"], ["updated_at", "2018-01-17 03:13:09.009358"], ["album_id", 1]]

  def destroy
    find_review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]

  def find_review
    @review ||= Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]